backend: tensorflow
class_name: Model
config:
  input_layers:
  - - h_input
    - 0
    - 0
  - - b_input
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 128
      dtype: float32
      name: h_input
      sparse: false
    inbound_nodes: []
    name: h_input
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 64
      dtype: float32
      name: b_input
      sparse: false
    inbound_nodes: []
    name: b_input
  - class_name: Concatenate
    config:
      axis: -1
      dtype: float32
      name: h_given_b
      trainable: true
    inbound_nodes:
    - - - h_input
        - 0
        - 0
        - &id001 {}
      - - b_input
        - 0
        - 0
        - *id001
    name: h_given_b
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.0099999
      kernel_regularizer: null
      name: mean_dense
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - h_given_b
        - 0
        - 0
        - {}
    name: mean_dense
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.0099999
      kernel_regularizer: null
      name: log_var_dense
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - h_given_b
        - 0
        - 0
        - {}
    name: log_var_dense
  - class_name: Lambda
    config:
      arguments:
        z_dim: 128
      dtype: float32
      function: !!python/tuple
      - '4wIAAAAAAAAACAAAAAYAAABDAAAAc1AAAABkAWQAbABqAX0CfABcAn0DfQR8AmoCfARkAmQDgwN9

        BXwCagN8A4MBZAEZAH0GfAJqBHwGfAFmAmQEZAVkBmQHjQR9B3wDfAV8BxQAFwBTACkITukAAAAA

        Z7yJ2Jey0pw8ZwAAAAAAQI9AZwAAAAAAAAAAZwAAAAAAAPA/2gdmbG9hdDMyKQTaBXNoYXBl2gRt

        ZWFu2gZzdGRkZXbaBWR0eXBlKQXaDWtlcmFzLmJhY2tlbmTaB2JhY2tlbmTaBGNsaXByAwAAANoN

        cmFuZG9tX25vcm1hbCkI2gRhcmdz2gV6X2RpbdoBa3IEAAAA2gdsb2dfdmFy2gVzY2FsZdoKYmF0

        Y2hfc2l6ZdoHZXBzaWxvbqkAchIAAAD6Ry9EQVRBL2hvbWUvbXVoYS9jb2RlL29ybnN0ZWluX2F1

        dG9fZW5jb2Rlci9vcm5zdGVpbl9hdXRvX2VuY29kZXIvb3BzLnB52ghzYW1wbGluZwkBAABzDAAA

        AAABCgEIAg4BDgEWAQ==

        '
      - null
      - null
      function_type: lambda
      name: e_given_x_sample
      output_shape: !!python/tuple
      - 128
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - mean_dense
        - 0
        - 0
        - &id002 {}
      - - log_var_dense
        - 0
        - 0
        - *id002
    name: e_given_x_sample
  name: encoder_e
  output_layers:
  - - e_given_x_sample
    - 0
    - 0
keras_version: 2.3.1
