backend: tensorflow
class_name: Model
config:
  input_layers:
  - - h_input
    - 0
    - 0
  - - b_input
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 64
      dtype: float32
      name: h_input
      sparse: false
    inbound_nodes: []
    name: h_input
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.0099999
      kernel_regularizer: null
      name: pre_e_h_dense
      trainable: true
      units: 32
      use_bias: true
    inbound_nodes:
    - - - h_input
        - 0
        - 0
        - {}
    name: pre_e_h_dense
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 1.0e-05
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: pre_e_h_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - pre_e_h_dense
        - 0
        - 0
        - {}
    name: pre_e_h_bn
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: pre_e_h_activation
      trainable: true
    inbound_nodes:
    - - - pre_e_h_bn
        - 0
        - 0
        - {}
    name: pre_e_h_activation
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 8
      dtype: float32
      name: b_input
      sparse: false
    inbound_nodes: []
    name: b_input
  - class_name: Concatenate
    config:
      axis: -1
      dtype: float32
      name: h_given_b
      trainable: true
    inbound_nodes:
    - - - pre_e_h_activation
        - 0
        - 0
        - &id001 {}
      - - b_input
        - 0
        - 0
        - *id001
    name: h_given_b
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.0099999
      kernel_regularizer: null
      name: mean_dense
      trainable: true
      units: 8
      use_bias: true
    inbound_nodes:
    - - - h_given_b
        - 0
        - 0
        - {}
    name: mean_dense
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: 0.0099999
      kernel_regularizer: null
      name: log_var_dense
      trainable: true
      units: 8
      use_bias: true
    inbound_nodes:
    - - - h_given_b
        - 0
        - 0
        - {}
    name: log_var_dense
  - class_name: Lambda
    config:
      arguments:
        z_dim: 8
      dtype: float32
      function: !!python/tuple
      - '4wIAAAAAAAAACAAAAAcAAABDAAAAc2AAAABkAWQAbABqAX0CfABcAn0DfQR8AmoCZAJ8AmoDfAJq

        BHwEZAhkA4MDgwEXAIMBfQV8AmoFfAODAWQBGQB9BnwCagZ8BnwBZgJkBGQFZAZkB40EfQd8A3wF

        fAcUABcAUwApCU7pAAAAAGc6jDDijnlFPmcAAAAAAABJQGcAAAAAAAAAAGcAAAAAAADwP9oHZmxv

        YXQzMikE2gVzaGFwZdoEbWVhbtoGc3RkZGV22gVkdHlwZWcAAAAAAABJwCkH2g1rZXJhcy5iYWNr

        ZW5k2gdiYWNrZW5k2gRzcXJ02gNleHDaBGNsaXByAwAAANoNcmFuZG9tX25vcm1hbCkI2gRhcmdz

        2gV6X2RpbdoBa3IEAAAA2gdsb2dfdmFy2gVzY2FsZdoKYmF0Y2hfc2l6ZdoHZXBzaWxvbqkAchQA

        AAD6Ry9EQVRBL2hvbWUvbXVoYS9jb2RlL29ybnN0ZWluX2F1dG9fZW5jb2Rlci9vcm5zdGVpbl9h

        dXRvX2VuY29kZXIvb3BzLnB52ghzYW1wbGluZ5cAAABzDAAAAAABCgEIAR4BDgEWAQ==

        '
      - null
      - null
      function_type: lambda
      name: e_given_x_sample
      output_shape: !!python/tuple
      - 8
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - mean_dense
        - 0
        - 0
        - &id002 {}
      - - log_var_dense
        - 0
        - 0
        - *id002
    name: e_given_x_sample
  name: encoder_e
  output_layers:
  - - e_given_x_sample
    - 0
    - 0
keras_version: 2.3.1
